_posts/2026-01-25-post-asynchronous_completion_token.md
```mermaid
sequenceDiagram
    participant App as ServerEventHandler
    participant Factory as AsynchReadStream
    participant Result as AsynchReadStreamResult:<br>AsynchResult
    participant Framework as Proactor

    App->>Factory: read(buffer, size)
    activate Factory
    Factory->>Result: create

    Factory->>Framework: startAio(AsynchResult)
    Note over Framework: Stores AsynchResult ( ACT )
    deactivate Factory
    
    Note over Framework: Operation Pending...
    
    Framework->>Result: complete(...)
    activate Result
    Result->>App: handleReadStream(AsynchResult)
    activate App
    App->>Result: message()
    Result-->>App: returns message
    Note over App: Process message fetched form AsynchResult ( ACT )
    deactivate App
    deactivate Result
```
